[
    {
      "riddle": "The person who makes it has no need of it; the person who buys it has no use for it. The person who uses it can neither see nor feel it. What is it?",
      "answer": "Coffin",
      "hint": "Used only once, never by choice."
    },
    {
      "riddle": "Until I am measured, I am not known. Yet how you miss me, when I have flown. What am I?",
      "answer": "Time",
      "hint": "You can't hold me, but you always feel me pass."
    },
    {
      "riddle": "What has many keys but cannot open a single lock?",
      "answer": "Piano",
      "hint": "Its notes unlock emotions, not doors."
    },
    {
      "riddle": "What can go up a chimney down, but can’t go down a chimney up?",
      "answer": "Umbrella",
      "hint": "It changes shape with a button and hates being closed the wrong way."
    },
    {
      "riddle": "What flies forever, rests never?",
      "answer": "Wind",
      "hint": "You can hear me howl, but never see my form."
    },
    {
      "riddle": "How many Friday the 13ths can there be in one calendar year?",
      "answer": "Three",
      "hint": "Think of the worst-case scenario — it’s surprisingly possible."
    },
    {
      "riddle": "What flowers are kissable?",
      "answer": "Tulips",
      "hint": "Say it out loud. Slowly."
    },
    {
      "riddle": "I speak without a mouth and listen without ears. I have no body, but I come alive with wind. What am I?",
      "answer": "Echo",
      "hint": "I'm your ghost in a canyon."
    },
    {
      "riddle": "The more you take from me, the bigger I become. What am I?",
      "answer": "Hole",
      "hint": "Subtraction leads to expansion."
    },
    {
      "riddle": "I have lakes but no water, roads but no cars, and mountains but no land. What am I?",
      "answer": "Map",
      "hint": "I hold the world in two dimensions."
    },
    {
      "riddle": "I turn once, what is out will not get in. I turn again, what is in will not get out. What am I?",
      "answer": "Key",
      "hint": "A small twist can unlock a world — or seal it."
    }
  ]
  